package ru.jamsys.core.handler.telegram.eye.card;

public class TarotOfManaraDeckCard extends AbstractDeckCard {

    protected TarotOfManaraDeckCard() {
        super("Таро Манара");
        getCards()
        .append(new CardImpl("Старшие арканы", "Шут", "Обнажённая девушка с воздушным шариком идёт по канату, не замечая опасности", "m0.jpg"))
        .append(new CardImpl("Старшие арканы", "Маг", "Мужчина в чёрном костюме смотрит на зрителя, за его спиной женская фигура", "m1.jpg"))
        .append(new CardImpl("Старшие арканы", "Жрица", "Женщина в полупрозрачном одеянии сидит на троне, в её руках книга тайн", "m2.jpg"))
        .append(new CardImpl("Старшие арканы", "Императрица", "Роскошная женщина на мягких подушках, окружённая цветами и символами плодородия", "m3.jpg"))
        .append(new CardImpl("Старшие арканы", "Император", "Мужчина в костюме держит женщину за волосы, показывая свою власть", "m4.jpg"))
        .append(new CardImpl("Старшие арканы", "Жрец", "Мудрый старец сидит на троне, а перед ним стоят две фигуры, ожидая наставления", "m5.jpg"))
        .append(new CardImpl("Старшие арканы", "Влюблённые", "Обнажённая пара сливается в страстном поцелуе, вокруг них размытый фон", "m6.jpg"))
        .append(new CardImpl("Старшие арканы", "Колесница", "Девушка с развевающимися волосами мчится вперёд на символической колеснице", "m7.jpg"))
        .append(new CardImpl("Старшие арканы", "Справедливость", "Женщина в строгом наряде держит весы, оценивая ситуацию", "m8.jpg"))
        .append(new CardImpl("Старшие арканы", "Отшельник", "Одинокий мужчина наблюдает за женщиной из тени, предпочитая изоляцию", "m9.jpg"))
        .append(new CardImpl("Старшие арканы", "Колесо Фортуны", "Женщина, окружённая масками и символами судьбы, наблюдает за происходящим", "m10.jpg"))
        .append(new CardImpl("Старшие арканы", "Сила", "Женщина обнимает мужчину, проявляя мягкую, но властную силу", "m11.jpg"))
        .append(new CardImpl("Старшие арканы", "Повешенный", "Обнажённая девушка висит вниз головой, словно в сладостном забвении", "m12.jpg"))
        .append(new CardImpl("Старшие арканы", "Смерть", "Женщина, стоящая у воды, провожает взглядом уходящий образ", "m13.jpg"))
        .append(new CardImpl("Старшие арканы", "Умеренность", "Грациозная фигура балансирует между двумя потоками энергии", "m14.jpg"))
        .append(new CardImpl("Старшие арканы", "Дьявол", "Мужчина властно держит женщину, подчинив её своей страсти", "m15.jpg"))
        .append(new CardImpl("Старшие арканы", "Башня", "Женщина в панике падает, разрушая старые устои", "m16.jpg"))
        .append(new CardImpl("Старшие арканы", "Звезда", "Обнажённая девушка черпает воду из источника, символизируя вдохновение", "m17.jpg"))
        .append(new CardImpl("Старшие арканы", "Луна", "Женщина, окружённая тенями, испытывает внутреннюю неуверенность", "m18.jpg"))
        .append(new CardImpl("Старшие арканы", "Солнце", "Пара наслаждается светом и теплом солнца, испытывая радость", "m19.jpg"))
        .append(new CardImpl("Старшие арканы", "Суд", "Женщина стоит перед зеркалом, осознавая свою трансформацию", "m20.jpg"))
        .append(new CardImpl("Старшие арканы", "Мир", "Свободная обнажённая женщина парит в пространстве, наслаждаясь гармонией", "m21.jpg"))

        ;
    }

}
